app/controllers/usuarios_controller.rb

  def index
    @usuarios = Usuario.all
---
SELECT "usuarios".* FROM "usuarios"

  def show
    @usuario = Usuario.find(params[:id])
---
SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @usuario = Usuario.new(usuario_params)

    if @usuario.save
---
INSERT INTO "usuarios" ("usuario", "nombre", "apellido", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["usuario", "ji"], ["nombre", "Juan"], ["apellido", "Integrador"], ["created_at", 2017-03-31 20:01:24 UTC], ["updated_at", 2017-03-31 20:01:24 UTC]]

    def set_usuario
      @usuario = Usuario.find(params[:id])
---
SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]